# Wire Type Wire Material Property

Source: https://www.revitapidocs.com/2026/2368b8a7-e5bb-cd73-84c5-adfb8dc36239.htm

---

| Wire Type Wire Material Property |
| --- |

The conductor material of the wire type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId WireMaterial { get; set; }
```

```
Public Property WireMaterial As ElementId
	Get
	Set
```

```
public:
property ElementId^ WireMaterial {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member WireMaterial : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a conductor material id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

WireType Class Autodesk.Revit.DB.Electrical Namespace